src/DataProcessors/ОткрытиеЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиеЗакрытиеСмены</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОткрытияСмены</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивБригад</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивУдаленных</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пейджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Documents/ЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеСмены</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ОткрытиеЗакрытиеСмены/Forms/ЗакрытиеНеРМ/module.bsl
Перем ПараметрыОкна Экспорт;	// структура, определяет положение и размеры окна
Перем СписокСмен;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры
 
Процедура ПриОткрытии()
Запрос = Новый Запрос("ВЫБРАТЬ  Первые 10
	|	ЛОЖЬ КАК Пометка,
	|	ОткрытиеСмены.МестоРеализации КАК МестоРеализации,
	|	ОткрытиеСмены.Номер КАК Номер,
	|	ОткрытиеСмены.Дата КАК Открыта,
	|	ЗакрытиеСмены.Дата КАК Закрыта,
	|	ОткрытиеСмены.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОткрытиеСмены КАК ОткрытиеСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|		ПО ОткрытиеСмены.Ссылка = ЗакрытиеСмены.Смена
	|ГДЕ
	|	ОткрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|	И ОткрытиеСмены.Дата > &ДатаС
	|	И ОткрытиеСмены.Дата < &ДатаПо
	|	И ЗакрытиеСмены.Дата ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Открыта УБЫВ");
	
	Запрос.УстановитьПараметр("ДатаС",ДобавитьМесяц(ТекущаяДата(),-2));
	Запрос.УстановитьПараметр("ДатаПо",НачалоДня(ТекущаяДата())-1);
	тзСмены = Запрос.Выполнить().Выгрузить();
	СписокСмен = Новый СписокЗначений;
	СписокСмен.ЗагрузитьЗначения(тзСмены.ВыгрузитьКолонку("Ссылка"));
	
	ПодключитьОбработчикОжидания("ВыбратьСмену",0.1,1);	
	
КонецПроцедуры

Процедура ВыбратьСмену() Экспорт
	
		элСмена = ВыбратьИзМеню(СписокСмен, ЭлементыФормы.КнопкаОК);
	Если элСмена = Неопределено Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	ТекСмена = элСмена.Значение;
	глПараметрыРМ = Новый Структура("МестоРеализации", ТекСмена.МестоРеализации);
	
	ДокОткрытияСмены = ТекСмена.ПолучитьОбъект();
	
	ЭлементыФормы.тЗаголовок		.Заголовок = "Закрытие смены № "+ДокОткрытияСмены.Номер;
	ЭлементыФормы.тДатаОткрытия		.Заголовок = "Время открытия: "+ДокОткрытияСмены.Дата;
	ЭлементыФормы.тМестоРеализации	.Заголовок = глПараметрыРМ.МестоРеализации.Наименование;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаОКНажатие(Элемент)
	
	Попытка
		ЗакрытьСмену();	
	Исключение
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
		ВыбратьСмену();
	КонецПопытки;
	
	
	Если ЭтаФорма.Открыта() Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры
